# DataFrame

- 2차원 행렬(Matrix)

> 엑셀에서 자주 본 형태입니다.

![](http://www.colaberry.com/wp-content/uploads/2017/10/TitanicPassengers.png)

## pandas import

In [1]:
import pandas as pd

## 데이터 프레임 만들기

- 사전형으로 데이터프레임 만들기

In [2]:
data = {
    "지역": ["수도권", "경상권"],
    "2015": [9904312, 3448737],
    "2010": [9631482, 3393191],
    "2005": [9762546, 3512547],
    "2000": [9853972, 3655437],
    "2010-2015 증가율": [0.0283, 0.0163]
}
# columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
# index = ["서울", "부산", "인천", "대구"]

In [3]:
df = pd.DataFrame(data)
df

    지역     2015     2010     2005     2000  2010-2015 증가율
0  수도권  9904312  9631482  9762546  9853972         0.0283
1  경상권  3448737  3393191  3512547  3655437         0.0163

> 보통은 csv 파일이 있어서 read해서 가져온다.  
`pd.read_csv('파일명')`

In [38]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df.T

                     0        1
지역                 수도권      경상권
2015           9904312  3448737
2010           9631482  3393191
2005           9762546  3512547
2000           9853972  3655437
2010-2015 증가율   0.0283   0.0163

In [26]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163]], dtype=object)

In [59]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

## 변형

- 갱신

In [4]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

    지역     2015     2010     2005     2000  2010-2015 증가율
0  수도권  9904312  9631482  9762546  9853972           2.83
1  경상권  3448737  3393191  3512547  3655437           1.63

In [5]:
for index,a in enumerate(df.columns):
    print(index,a)

0 지역
1 2015
2 2010
3 2005
4 2000
5 2010-2015 증가율

In [6]:
df.columns.values[5] = 'i_rate_2010_2015'

In [7]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', 'i_rate_2010_2015'], dtype='object')

- 추가

In [8]:
((df["2010"] - df["2005"]) / df["2005"] * 100)

0   -1.342519
1   -3.397990
dtype: float64

In [9]:
((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)

0   -1.34
1   -3.40
dtype: float64

In [12]:
df["i_rate_2005_2010"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

    지역     2015     2010     2005     2000  i_rate_2010_2015  i_rate_2005_2010
0  수도권  9904312  9631482  9762546  9853972              2.83             -1.34
1  경상권  3448737  3393191  3512547  3655437              1.63             -3.40

- 삭제

In [14]:
df.drop('i_rate_2010_2015',1) #1은 열 기준, 0은 행 기준

    지역     2015     2010     2005     2000  i_rate_2005_2010
0  수도권  9904312  9631482  9762546  9853972             -1.34
1  경상권  3448737  3393191  3512547  3655437             -3.40

In [18]:
df

    지역     2015     2010     2005     2000  i_rate_2010_2015  i_rate_2005_2010
0  수도권  9904312  9631482  9762546  9853972              2.83             -1.34
1  경상권  3448737  3393191  3512547  3655437              1.63             -3.40

In [26]:
#index로 삭제
df.drop(1)

    지역     2015     2010     2005     2000  i_rate_2010_2015  i_rate_2005_2010
0  수도권  9904312  9631482  9762546  9853972              2.83             -1.34

## 인덱싱

In [27]:
df['지역']

0    수도권
1    경상권
Name: 지역, dtype: object

In [28]:
df['지역'][0]

'수도권'

In [29]:
df[['2010','2015']]

      2010     2015
0  9631482  9904312
1  3393191  3448737

- 행 단위  
슬라이싱 필요

In [30]:
df[0:]

    지역     2015     2010     2005     2000  i_rate_2010_2015  i_rate_2005_2010
0  수도권  9904312  9631482  9762546  9853972              2.83             -1.34
1  경상권  3448737  3393191  3512547  3655437              1.63             -3.40

In [31]:
type(df['지역']) #판다스에서는 1차원 배열을 Series 자료구조라고 함

pandas.core.series.Series